{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "name": "features", "sparse": false}, "name": "features", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"output_shape": null, "name": "normed", "output_shape_type": "raw", "trainable": false, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s'\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001}\u0000\u0000d\u0005\u0000|\u0000\u0000d\u0004\u0000\u001b\u0017}\u0001\u0000|\u0001\u0000S)\u0006\u00fa\u0014x should be a tensor\u00da\u0005dtype\u00da\u0007float32\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0\u00bf)\u0002\u00da\u0001K\u00da\u0004cast)\u0002\u00da\u0001x\u00da\u0006normed\u00a9\u0000r\n\u0000\u0000\u0000\u00fa\bmodel.py\u00da\tnormalizeZ\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0002\u0015\u0001\u000e\u0001", null, null], "arguments": {}, "function_type": "lambda"}, "name": "normed", "inbound_nodes": [[["features", 0, 0]]]}, {"class_name": "AveragePooling2D", "config": {"pool_size": [4, 4], "border_mode": "valid", "dim_ordering": "tf", "strides": [4, 4], "trainable": false, "name": "resized"}, "name": "resized", "inbound_nodes": [[["normed", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "nb_row": 5, "nb_col": 5, "trainable": true, "name": "conv1", "W_constraint": null, "nb_filter": 16, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "conv1", "inbound_nodes": [[["resized", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "conv1_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "name": "pool1"}, "name": "pool1", "inbound_nodes": [[["conv1_bn", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "nb_row": 3, "nb_col": 3, "trainable": true, "name": "conv2", "W_constraint": null, "nb_filter": 32, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "conv2", "inbound_nodes": [[["pool1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "conv2_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "conv2_bn", "inbound_nodes": [[["conv2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "nb_row": 3, "nb_col": 3, "trainable": true, "name": "res1_conv1", "W_constraint": null, "nb_filter": 32, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "res1_conv1", "inbound_nodes": [[["conv2_bn", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "res1_conv1_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "res1_conv1_bn", "inbound_nodes": [[["res1_conv1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "nb_row": 3, "nb_col": 3, "trainable": true, "name": "res1_conv2", "W_constraint": null, "nb_filter": 32, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "res1_conv2", "inbound_nodes": [[["res1_conv1_bn", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "res1_conv2_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "res1_conv2_bn", "inbound_nodes": [[["res1_conv2", 0, 0]]]}, {"class_name": "Merge", "config": {"name": "res1_sum", "output_mask": null, "output_shape": null, "arguments": {}, "concat_axis": -1, "dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "name": "res1_sum", "inbound_nodes": [[["conv2_bn", 0, 0], ["res1_conv2_bn", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "name": "pool2"}, "name": "pool2", "inbound_nodes": [[["res1_sum", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "nb_row": 3, "nb_col": 3, "trainable": true, "name": "conv3", "W_constraint": null, "nb_filter": 64, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "conv3", "inbound_nodes": [[["pool2", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "conv3_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "conv3_bn", "inbound_nodes": [[["conv3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "nb_row": 3, "nb_col": 3, "trainable": true, "name": "res2_conv1", "W_constraint": null, "nb_filter": 64, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "res2_conv1", "inbound_nodes": [[["conv3_bn", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "res2_conv1_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "res2_conv1_bn", "inbound_nodes": [[["res2_conv1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "nb_row": 3, "nb_col": 3, "trainable": true, "name": "res2_conv2", "W_constraint": null, "nb_filter": 64, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "res2_conv2", "inbound_nodes": [[["res2_conv1_bn", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "res2_conv2_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "res2_conv2_bn", "inbound_nodes": [[["res2_conv2", 0, 0]]]}, {"class_name": "Merge", "config": {"name": "res2_sum", "output_mask": null, "output_shape": null, "arguments": {}, "concat_axis": -1, "dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "name": "res2_sum", "inbound_nodes": [[["conv3_bn", 0, 0], ["res2_conv2_bn", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "name": "pool3"}, "name": "pool3", "inbound_nodes": [[["res2_sum", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "nb_row": 3, "nb_col": 3, "trainable": true, "name": "conv4", "W_constraint": null, "nb_filter": 128, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "conv4", "inbound_nodes": [[["pool3", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "conv4_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "conv4_bn", "inbound_nodes": [[["conv4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "nb_row": 3, "nb_col": 3, "trainable": true, "name": "res3_conv1", "W_constraint": null, "nb_filter": 128, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "res3_conv1", "inbound_nodes": [[["conv4_bn", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "res3_conv1_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "res3_conv1_bn", "inbound_nodes": [[["res3_conv1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "same", "nb_row": 3, "nb_col": 3, "trainable": true, "name": "res3_conv2", "W_constraint": null, "nb_filter": 128, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "res3_conv2", "inbound_nodes": [[["res3_conv1_bn", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "res3_conv2_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "res3_conv2_bn", "inbound_nodes": [[["res3_conv2", 0, 0]]]}, {"class_name": "Merge", "config": {"name": "res3_sum", "output_mask": null, "output_shape": null, "arguments": {}, "concat_axis": -1, "dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "name": "res3_sum", "inbound_nodes": [[["conv4_bn", 0, 0], ["res3_conv2_bn", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "nb_row": 3, "nb_col": 3, "trainable": true, "name": "conv5", "W_constraint": null, "nb_filter": 128, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "conv5", "inbound_nodes": [[["res3_sum", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "conv5_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "conv5_bn", "inbound_nodes": [[["conv5", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "border_mode": "valid", "nb_row": 3, "nb_col": 3, "trainable": true, "name": "conv6", "W_constraint": null, "nb_filter": 128, "b_regularizer": null, "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "dim_ordering": "tf", "activation": "relu", "bias": true}, "name": "conv6", "inbound_nodes": [[["conv5_bn", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "conv6_bn", "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 0}, "name": "conv6_bn", "inbound_nodes": [[["conv6", 0, 0]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten"}, "name": "flatten", "inbound_nodes": [[["conv6_bn", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 768, "trainable": true, "name": "fc1", "output_dim": 128, "bias": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu"}, "name": "fc1", "inbound_nodes": [[["flatten", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc1_dropout", "p": 0.5}, "name": "fc1_dropout", "inbound_nodes": [[["fc1", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 128, "trainable": true, "name": "fc2", "output_dim": 64, "bias": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu"}, "name": "fc2", "inbound_nodes": [[["fc1_dropout", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc2_dropout", "p": 0.5}, "name": "fc2_dropout", "inbound_nodes": [[["fc2", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 64, "trainable": true, "name": "fc3", "output_dim": 16, "bias": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "relu"}, "name": "fc3", "inbound_nodes": [[["fc2_dropout", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "fc3_dropout", "p": 0.5}, "name": "fc3_dropout", "inbound_nodes": [[["fc3", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 16, "trainable": true, "name": "predicts", "output_dim": 1, "bias": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear"}, "name": "predicts", "inbound_nodes": [[["fc3_dropout", 0, 0]]]}], "input_layers": [["features", 0, 0]], "output_layers": [["predicts", 0, 0]], "name": "model_1"}}