{"config": {"output_layers": [["predicts", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"sparse": false, "input_dtype": "float32", "name": "features", "batch_input_shape": [null, 160, 320, 3]}, "name": "features", "class_name": "InputLayer"}, {"inbound_nodes": [[["features", 0, 0]]], "config": {"output_shape": null, "trainable": false, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s'\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000d\u0002\u0000\u0083\u0001\u0001}\u0000\u0000d\u0005\u0000|\u0000\u0000d\u0004\u0000\u001b\u0017}\u0001\u0000|\u0001\u0000S)\u0006\u00fa\u0014x should be a tensor\u00da\u0005dtype\u00da\u0007float32\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0\u00bf)\u0002\u00da\u0001K\u00da\u0004cast)\u0002\u00da\u0001x\u00da\u0006normed\u00a9\u0000r\n\u0000\u0000\u0000\u00fa\bmodel.py\u00da\tnormalizeZ\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0002\u0015\u0001\u000e\u0001", null, null], "function_type": "lambda", "arguments": {}, "name": "normed"}, "name": "normed", "class_name": "Lambda"}, {"inbound_nodes": [[["normed", 0, 0]]], "config": {"name": "resized", "border_mode": "valid", "dim_ordering": "tf", "trainable": false, "pool_size": [4, 4], "strides": [4, 4]}, "name": "resized", "class_name": "AveragePooling2D"}, {"inbound_nodes": [[["resized", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 16, "trainable": true, "nb_col": 5, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "conv1", "nb_row": 5}, "name": "conv1", "class_name": "Convolution2D"}, {"inbound_nodes": [[["conv1", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "conv1_bn"}, "name": "conv1_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv1_bn", 0, 0]]], "config": {"name": "pool1", "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "name": "pool1", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["pool1", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 32, "trainable": true, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "conv2", "nb_row": 3}, "name": "conv2", "class_name": "Convolution2D"}, {"inbound_nodes": [[["conv2", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "conv2_bn"}, "name": "conv2_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2_bn", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 32, "trainable": true, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "res1_conv1", "nb_row": 3}, "name": "res1_conv1", "class_name": "Convolution2D"}, {"inbound_nodes": [[["res1_conv1", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "res1_conv1_bn"}, "name": "res1_conv1_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["res1_conv1_bn", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 32, "trainable": true, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "res1_conv2", "nb_row": 3}, "name": "res1_conv2", "class_name": "Convolution2D"}, {"inbound_nodes": [[["res1_conv2", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "res1_conv2_bn"}, "name": "res1_conv2_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv2_bn", 0, 0], ["res1_conv2_bn", 0, 0]]], "config": {"output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "mode": "sum", "mode_type": "raw", "arguments": {}, "output_mask": null, "name": "res1_sum", "dot_axes": -1, "output_mask_type": "raw"}, "name": "res1_sum", "class_name": "Merge"}, {"inbound_nodes": [[["res1_sum", 0, 0]]], "config": {"name": "pool2", "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "name": "pool2", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["pool2", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 64, "trainable": true, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "conv3", "nb_row": 3}, "name": "conv3", "class_name": "Convolution2D"}, {"inbound_nodes": [[["conv3", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "conv3_bn"}, "name": "conv3_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv3_bn", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 64, "trainable": true, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "res2_conv1", "nb_row": 3}, "name": "res2_conv1", "class_name": "Convolution2D"}, {"inbound_nodes": [[["res2_conv1", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "res2_conv1_bn"}, "name": "res2_conv1_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["res2_conv1_bn", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 64, "trainable": true, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "res2_conv2", "nb_row": 3}, "name": "res2_conv2", "class_name": "Convolution2D"}, {"inbound_nodes": [[["res2_conv2", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "res2_conv2_bn"}, "name": "res2_conv2_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv3_bn", 0, 0], ["res2_conv2_bn", 0, 0]]], "config": {"output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "mode": "sum", "mode_type": "raw", "arguments": {}, "output_mask": null, "name": "res2_sum", "dot_axes": -1, "output_mask_type": "raw"}, "name": "res2_sum", "class_name": "Merge"}, {"inbound_nodes": [[["res2_sum", 0, 0]]], "config": {"name": "pool3", "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "name": "pool3", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["pool3", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 128, "trainable": true, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "conv4", "nb_row": 3}, "name": "conv4", "class_name": "Convolution2D"}, {"inbound_nodes": [[["conv4", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "conv4_bn"}, "name": "conv4_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv4_bn", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 128, "trainable": true, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "res3_conv1", "nb_row": 3}, "name": "res3_conv1", "class_name": "Convolution2D"}, {"inbound_nodes": [[["res3_conv1", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "res3_conv1_bn"}, "name": "res3_conv1_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["res3_conv1_bn", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 128, "trainable": true, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "res3_conv2", "nb_row": 3}, "name": "res3_conv2", "class_name": "Convolution2D"}, {"inbound_nodes": [[["res3_conv2", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "res3_conv2_bn"}, "name": "res3_conv2_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv4_bn", 0, 0], ["res3_conv2_bn", 0, 0]]], "config": {"output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "mode": "sum", "mode_type": "raw", "arguments": {}, "output_mask": null, "name": "res3_sum", "dot_axes": -1, "output_mask_type": "raw"}, "name": "res3_sum", "class_name": "Merge"}, {"inbound_nodes": [[["res3_sum", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 128, "trainable": true, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "conv5", "nb_row": 3}, "name": "conv5", "class_name": "Convolution2D"}, {"inbound_nodes": [[["conv5", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "conv5_bn"}, "name": "conv5_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv5_bn", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "nb_filter": 128, "trainable": true, "nb_col": 3, "activation": "relu", "subsample": [1, 1], "W_constraint": null, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "activity_regularizer": null, "name": "conv6", "nb_row": 3}, "name": "conv6", "class_name": "Convolution2D"}, {"inbound_nodes": [[["conv6", 0, 0]]], "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "conv6_bn"}, "name": "conv6_bn", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["conv6_bn", 0, 0]]], "config": {"trainable": true, "name": "flatten"}, "name": "flatten", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "input_dim": 768, "W_constraint": null, "bias": true, "output_dim": 128, "init": "glorot_uniform", "activity_regularizer": null, "name": "fc1"}, "name": "fc1", "class_name": "Dense"}, {"inbound_nodes": [[["fc1", 0, 0]]], "config": {"trainable": true, "p": 0.5, "name": "fc1_dropout"}, "name": "fc1_dropout", "class_name": "Dropout"}, {"inbound_nodes": [[["fc1_dropout", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "input_dim": 128, "W_constraint": null, "bias": true, "output_dim": 64, "init": "glorot_uniform", "activity_regularizer": null, "name": "fc2"}, "name": "fc2", "class_name": "Dense"}, {"inbound_nodes": [[["fc2", 0, 0]]], "config": {"trainable": true, "p": 0.5, "name": "fc2_dropout"}, "name": "fc2_dropout", "class_name": "Dropout"}, {"inbound_nodes": [[["fc2_dropout", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "input_dim": 64, "W_constraint": null, "bias": true, "output_dim": 16, "init": "glorot_uniform", "activity_regularizer": null, "name": "fc3"}, "name": "fc3", "class_name": "Dense"}, {"inbound_nodes": [[["fc3", 0, 0]]], "config": {"trainable": true, "p": 0.5, "name": "fc3_dropout"}, "name": "fc3_dropout", "class_name": "Dropout"}, {"inbound_nodes": [[["fc3_dropout", 0, 0]]], "config": {"W_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "input_dim": 16, "W_constraint": null, "bias": true, "output_dim": 1, "init": "glorot_uniform", "activity_regularizer": null, "name": "predicts"}, "name": "predicts", "class_name": "Dense"}], "input_layers": [["features", 0, 0]], "name": "model_1"}, "class_name": "Model", "keras_version": "1.2.0"}